#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.github_repo["roguna"].github_repository.repo: Refreshing state... [id=roguna]
module.github_repo["summit-formule"].github_repository.repo: Refreshing state... [id=summit-formule]
module.github_repo["go-api-hello-world"].github_repository.repo: Refreshing state... [id=go-api-hello-world]
module.github_repo["apprepo-dash"].github_repository.repo: Refreshing state... [id=apprepo-dash]
module.github_repo["maze"].github_repository.repo: Refreshing state... [id=maze]
module.github_repo["go101"].github_repository.repo: Refreshing state... [id=go101]
module.github_repo["go-cci-trigger"].github_repository.repo: Refreshing state... [id=go-cci-trigger]
module.github_repo["bara"].github_repository.repo: Refreshing state... [id=bara]
module.github_repo["summit-pokemon"].github_repository.repo: Refreshing state... [id=summit-pokemon]
module.github_repo["devops-workshop"].github_repository.repo: Refreshing state... [id=devops-workshop]
module.github_repo["vaclav-dvorak"].github_repository.repo: Refreshing state... [id=vaclav-dvorak]
module.github_repo["fiddo"].github_repository.repo: Refreshing state... [id=fiddo]
module.github_repo["wsl-setup"].github_repository.repo: Refreshing state... [id=wsl-setup]
module.github_repo["frajer"].github_repository.repo: Refreshing state... [id=frajer]
module.github_repo["toulky"].github_repository.repo: Refreshing state... [id=toulky]
module.github_repo["game-of-life"].github_repository.repo: Refreshing state... [id=game-of-life]
module.github_repo["vccsturm"].github_repository.repo: Refreshing state... [id=vccsturm]
module.github_repo["anna-helmova"].github_repository.repo: Refreshing state... [id=anna-helmova]
module.github_repo["dpd-test"].github_repository.repo: Refreshing state... [id=dpd-test]
module.github_repo["mefbox"].github_repository.repo: Refreshing state... [id=mefbox]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.github_repo["go101"].github_repository.repo has been changed
  ~ resource "github_repository" "repo" {
      ~ etag                   = "W/\"80de0cca1ac02c295d5573541d5772054296e9439fb2a4bc0da668c9e4bd0afb\"" -> "W/\"a176f3fcb71403fb27bd7c62190a36898b45c78badab83632c656b3809fc2f7d\""
        id                     = "go101"
        name                   = "go101"
        # (25 unchanged attributes hidden)
    }
  # module.github_repo["roguna"].github_repository.repo has been changed
  ~ resource "github_repository" "repo" {
      ~ etag                   = "W/\"899ba5547ae8dc9c25daa283cbdf44160fec42711ee06702189862e639860735\"" -> "W/\"30617f9b4d2c5479af01463b7df80f13efccd9e8578df08ccb02d33253d167c5\""
        id                     = "roguna"
        name                   = "roguna"
        # (27 unchanged attributes hidden)
    }
  # module.github_repo["go-cci-trigger"].github_repository.repo has been changed
  ~ resource "github_repository" "repo" {
      ~ etag                   = "W/\"8bf4897136375088d4acc95df393653c05b493a99125707ee69cb6e6c1923805\"" -> "W/\"22bcf9e8b5b0062382dc2b20da5a8443679266daddec6b18c9e42d9e6381ce56\""
        id                     = "go-cci-trigger"
        name                   = "go-cci-trigger"
      + topics                 = []
        # (26 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.github_repo["go-telegram-test"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_merge_commit     = false
      + allow_rebase_merge     = true
      + allow_squash_merge     = false
      + archived               = false
      + auto_init              = true
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Attempt on telegram bot with golang"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Go"
      + has_downloads          = false
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "mit"
      + name                   = "go-telegram-test"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "private"
      + vulnerability_alerts   = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @vaclav-dvorak, Action: `pull_request`*